// Введение, знакомство с IDE VS code 
//(Форматирование кода Shift+Alt+F, Shift + Alt + ↓ — дублировать строку вниз, запуск программы)

void main() {
  // Вывод информации в консоль (print)
  // Арифметические операторы
  // Комментарии
  // Базовые типы данных
  // Конкатенация и интерполяция строк
  // Операции со строками
  // Особенности системы типов Dart (var, final, const, dynamic)
  // Ввод информации из консоли (stdin)
  int a = 10;
  print('Hello, Dart Lesson 1!');
  print(a * 7);
  print('End od program.');
}
